Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/BZ3/include/component/rot.h
/*
 * Component description for ROT
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2023-04-11T16:47:11Z */
#ifndef _PIC32CXBZ31_ROT_COMPONENT_H_
#define _PIC32CXBZ31_ROT_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR ROT                                          */
/* ************************************************************************** */

/* -------- ROT_SECCFG : (ROT Offset: 0x00) (R/W 32) Secure Configuration HOLDING REGISTER1,2 -------- */
#define ROT_SECCFG_RESETVALUE                 _UINT32_(0x00)                                       /*  (ROT_SECCFG) Secure Configuration HOLDING REGISTER1,2  Reset Value */

#define ROT_SECCFG_UUID_LCK_Pos               _UINT32_(4)                                          /* (ROT_SECCFG) Programming lock bits for Unique ID fuses Position */
#define ROT_SECCFG_UUID_LCK_Msk               (_UINT32_(0x3) << ROT_SECCFG_UUID_LCK_Pos)           /* (ROT_SECCFG) Programming lock bits for Unique ID fuses Mask */
#define ROT_SECCFG_UUID_LCK(value)            (ROT_SECCFG_UUID_LCK_Msk & (_UINT32_(value) << ROT_SECCFG_UUID_LCK_Pos)) /* Assigment of value for UUID_LCK in the ROT_SECCFG register */
#define   ROT_SECCFG_UUID_LCK_0_Val           _UINT32_(0x0)                                        /* (ROT_SECCFG) Unique ID is not locked  */
#define   ROT_SECCFG_UUID_LCK_1_Val           _UINT32_(0x1)                                        /* (ROT_SECCFG) Unique ID is locked and cannot be programmed  */
#define   ROT_SECCFG_UUID_LCK_2_Val           _UINT32_(0x2)                                        /* (ROT_SECCFG) Unique ID is locked and cannot be programmed  */
#define   ROT_SECCFG_UUID_LCK_3_Val           _UINT32_(0x3)                                        /* (ROT_SECCFG) Unique ID is locked and cannot be programmed  */
#define ROT_SECCFG_UUID_LCK_0                 (ROT_SECCFG_UUID_LCK_0_Val << ROT_SECCFG_UUID_LCK_Pos) /* (ROT_SECCFG) Unique ID is not locked Position  */
#define ROT_SECCFG_UUID_LCK_1                 (ROT_SECCFG_UUID_LCK_1_Val << ROT_SECCFG_UUID_LCK_Pos) /* (ROT_SECCFG) Unique ID is locked and cannot be programmed Position  */
#define ROT_SECCFG_UUID_LCK_2                 (ROT_SECCFG_UUID_LCK_2_Val << ROT_SECCFG_UUID_LCK_Pos) /* (ROT_SECCFG) Unique ID is locked and cannot be programmed Position  */
#define ROT_SECCFG_UUID_LCK_3                 (ROT_SECCFG_UUID_LCK_3_Val << ROT_SECCFG_UUID_LCK_Pos) /* (ROT_SECCFG) Unique ID is locked and cannot be programmed Position  */
#define ROT_SECCFG_DEBUG_LCK_Pos              _UINT32_(6)                                          /* (ROT_SECCFG) Lock bits for debug/programming Position */
#define ROT_SECCFG_DEBUG_LCK_Msk              (_UINT32_(0x3) << ROT_SECCFG_DEBUG_LCK_Pos)          /* (ROT_SECCFG) Lock bits for debug/programming Mask */
#define ROT_SECCFG_DEBUG_LCK(value)           (ROT_SECCFG_DEBUG_LCK_Msk & (_UINT32_(value) << ROT_SECCFG_DEBUG_LCK_Pos)) /* Assigment of value for DEBUG_LCK in the ROT_SECCFG register */
#define   ROT_SECCFG_DEBUG_LCK_0_Val          _UINT32_(0x0)                                        /* (ROT_SECCFG) Debug is not locked  */
#define   ROT_SECCFG_DEBUG_LCK_1_Val          _UINT32_(0x1)                                        /* (ROT_SECCFG) Debug is locked  */
#define   ROT_SECCFG_DEBUG_LCK_2_Val          _UINT32_(0x2)                                        /* (ROT_SECCFG) Debug is locked  */
#define   ROT_SECCFG_DEBUG_LCK_3_Val          _UINT32_(0x3)                                        /* (ROT_SECCFG) Debug is locked  */
#define ROT_SECCFG_DEBUG_LCK_0                (ROT_SECCFG_DEBUG_LCK_0_Val << ROT_SECCFG_DEBUG_LCK_Pos) /* (ROT_SECCFG) Debug is not locked Position  */
#define ROT_SECCFG_DEBUG_LCK_1                (ROT_SECCFG_DEBUG_LCK_1_Val << ROT_SECCFG_DEBUG_LCK_Pos) /* (ROT_SECCFG) Debug is locked Position  */
#define ROT_SECCFG_DEBUG_LCK_2                (ROT_SECCFG_DEBUG_LCK_2_Val << ROT_SECCFG_DEBUG_LCK_Pos) /* (ROT_SECCFG) Debug is locked Position  */
#define ROT_SECCFG_DEBUG_LCK_3                (ROT_SECCFG_DEBUG_LCK_3_Val << ROT_SECCFG_DEBUG_LCK_Pos) /* (ROT_SECCFG) Debug is locked Position  */
#define ROT_SECCFG_ROOT_KEY_LCK_Pos           _UINT32_(8)                                          /* (ROT_SECCFG) Lock bits for storage root Key Position */
#define ROT_SECCFG_ROOT_KEY_LCK_Msk           (_UINT32_(0x3) << ROT_SECCFG_ROOT_KEY_LCK_Pos)       /* (ROT_SECCFG) Lock bits for storage root Key Mask */
#define ROT_SECCFG_ROOT_KEY_LCK(value)        (ROT_SECCFG_ROOT_KEY_LCK_Msk & (_UINT32_(value) << ROT_SECCFG_ROOT_KEY_LCK_Pos)) /* Assigment of value for ROOT_KEY_LCK in the ROT_SECCFG register */
#define   ROT_SECCFG_ROOT_KEY_LCK_0_Val       _UINT32_(0x0)                                        /* (ROT_SECCFG) Storage root key is not locked  */
#define   ROT_SECCFG_ROOT_KEY_LCK_1_Val       _UINT32_(0x1)                                        /* (ROT_SECCFG) Storage root key is locked and cannot be programmed  */
#define   ROT_SECCFG_ROOT_KEY_LCK_2_Val       _UINT32_(0x2)                                        /* (ROT_SECCFG) Storage root key is locked and cannot be programmed  */
#define   ROT_SECCFG_ROOT_KEY_LCK_3_Val       _UINT32_(0x3)                                        /* (ROT_SECCFG) Storage root key is locked and cannot be programmed  */
#define ROT_SECCFG_ROOT_KEY_LCK_0             (ROT_SECCFG_ROOT_KEY_LCK_0_Val << ROT_SECCFG_ROOT_KEY_LCK_Pos) /* (ROT_SECCFG) Storage root key is not locked Position  */
#define ROT_SECCFG_ROOT_KEY_LCK_1             (ROT_SECCFG_ROOT_KEY_LCK_1_Val << ROT_SECCFG_ROOT_KEY_LCK_Pos) /* (ROT_SECCFG) Storage root key is locked and cannot be programmed Position  */
#define ROT_SECCFG_ROOT_KEY_LCK_2             (ROT_SECCFG_ROOT_KEY_LCK_2_Val << ROT_SECCFG_ROOT_KEY_LCK_Pos) /* (ROT_SECCFG) Storage root key is locked and cannot be programmed Position  */
#define ROT_SECCFG_ROOT_KEY_LCK_3             (ROT_SECCFG_ROOT_KEY_LCK_3_Val << ROT_SECCFG_ROOT_KEY_LCK_Pos) /* (ROT_SECCFG) Storage root key is locked and cannot be programmed Position  */
#define ROT_SECCFG_BOOT_KEY_LCK_Pos           _UINT32_(10)                                         /* (ROT_SECCFG) Lock bits for Secure Boot/OTA Key Position */
#define ROT_SECCFG_BOOT_KEY_LCK_Msk           (_UINT32_(0x3) << ROT_SECCFG_BOOT_KEY_LCK_Pos)       /* (ROT_SECCFG) Lock bits for Secure Boot/OTA Key Mask */
#define ROT_SECCFG_BOOT_KEY_LCK(value)        (ROT_SECCFG_BOOT_KEY_LCK_Msk & (_UINT32_(value) << ROT_SECCFG_BOOT_KEY_LCK_Pos)) /* Assigment of value for BOOT_KEY_LCK in the ROT_SECCFG register */
#define   ROT_SECCFG_BOOT_KEY_LCK_0_Val       _UINT32_(0x0)                                        /* (ROT_SECCFG) Secure boot key is not locked  */
#define   ROT_SECCFG_BOOT_KEY_LCK_1_Val       _UINT32_(0x1)                                        /* (ROT_SECCFG) Secure boot key is locked and cannot be programmed  */
#define   ROT_SECCFG_BOOT_KEY_LCK_2_Val       _UINT32_(0x2)                                        /* (ROT_SECCFG) Secure boot key is locked and cannot be programmed  */
#define   ROT_SECCFG_BOOT_KEY_LCK_3_Val       _UINT32_(0x3)                                        /* (ROT_SECCFG) Secure boot key is locked and cannot be programmed  */
#define ROT_SECCFG_BOOT_KEY_LCK_0             (ROT_SECCFG_BOOT_KEY_LCK_0_Val << ROT_SECCFG_BOOT_KEY_LCK_Pos) /* (ROT_SECCFG) Secure boot key is not locked Position  */
#define ROT_SECCFG_BOOT_KEY_LCK_1             (ROT_SECCFG_BOOT_KEY_LCK_1_Val << ROT_SECCFG_BOOT_KEY_LCK_Pos) /* (ROT_SECCFG) Secure boot key is locked and cannot be programmed Position  */
#define ROT_SECCFG_BOOT_KEY_LCK_2             (ROT_SECCFG_BOOT_KEY_LCK_2_Val << ROT_SECCFG_BOOT_KEY_LCK_Pos) /* (ROT_SECCFG) Secure boot key is locked and cannot be programmed Position  */
#define ROT_SECCFG_BOOT_KEY_LCK_3             (ROT_SECCFG_BOOT_KEY_LCK_3_Val << ROT_SECCFG_BOOT_KEY_LCK_Pos) /* (ROT_SECCFG) Secure boot key is locked and cannot be programmed Position  */
#define ROT_SECCFG_ADD_BOOT_KEY_Pos           _UINT32_(16)                                         /* (ROT_SECCFG) Additional boot Key bit Position */
#define ROT_SECCFG_ADD_BOOT_KEY_Msk           (_UINT32_(0x1) << ROT_SECCFG_ADD_BOOT_KEY_Pos)       /* (ROT_SECCFG) Additional boot Key bit Mask */
#define ROT_SECCFG_ADD_BOOT_KEY(value)        (ROT_SECCFG_ADD_BOOT_KEY_Msk & (_UINT32_(value) << ROT_SECCFG_ADD_BOOT_KEY_Pos)) /* Assigment of value for ADD_BOOT_KEY in the ROT_SECCFG register */
#define ROT_SECCFG_Msk                        _UINT32_(0x00010FF0)                                 /* (ROT_SECCFG) Register Mask  */


